import java.io.*;

public class B2448_별찍기11_오화랑 {
    public static void main(String[] args) throws IOException {
        BufferedReader input = new BufferedReader(new InputStreamReader(System.in));
        int size = Integer.parseInt(input.readLine());
        drawStar(size, size);
    }

    public static void drawStar(int size, int startPoint) {
        if (size == 3) {

        }

    }
}

// 규칙을 유추한 뒤에 별을 찍자
// N은 항상 3 * 2^k (k : 0 ~ 10) => 3, 6, 12, 24, 48, 96, 192, 384, 768, 1536, 3072
/*
 * 
 * N = 24
 * 
 * *
 ***** 
 * *
 * * * *
 ***** *****
 * *
 * * * *
 ***** *****
 * * * *
 * * * * * * * *
 ***** ***** ***** *****
 * *
 * * * *
 ***** *****
 * * * *
 * * * * * * * *
 ***** ***** ***** *****
 * * * *
 * * * * * * * *
 ***** ***** ***** *****
 * * * * * * * *
 * * * * * * * * * * * * * * * *
 ***** ***** ***** ***** ***** ***** ***** *****
 * 1 - 3 - 5(3) - 7 - 9 - 11 (6)- 13 - 15 - 17 - 19 - 21 - 23(12)
 * 
 * *
 ***** 
 * *
 * * * *
 ***** *****
 * *
 * * * *
 ***** *****
 * * * *
 * * * * * * * *
 ***** ***** ***** *****
 * *
 * * * *
 ***** *****
 * * * *
 * * * * * * * *
 ***** ***** ***** *****
 * * * *
 * * * * * * * *
 ***** ***** ***** *****
 * * * * * * * *
 * * * * * * * * * * * * * * * *
 ***** ***** ***** ***** ***** ***** ***** *****
 */